bundles/org.openhab.binding.ihc/src/test/resources/ResourceValueUpdate300003.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body>
  <setResourceValue1 xmlns="utcs">
   <value xmlns:q1="utcs.values" xsi:type="q1:WSEnumValue">
    <q1:definitionTypeID>11111</q1:definitionTypeID>
    <q1:enumValueID>22222</q1:enumValueID>
    <q1:enumName>test123</q1:enumName>
   </value>
   <resourceID>300003</resourceID>
   <isValueRuntime>true</isValueRuntime>
  </setResourceValue1>
 </soap:Body>
</soap:Envelope>